RomuloGatto/microlink/examples/modem_watchdog/sdkconfig.defaults
# Modem Watchdog - classic ESP32 / WROOM
CONFIG_IDF_TARGET="esp32"

# Keep the no-PSRAM WROOM footprint conservative.
CONFIG_ML_H2_BUFFER_SIZE_KB=64
CONFIG_ML_MAX_PEERS=8
CONFIG_ML_NVS_MAX_PEERS=32

# We provide our own port-80 watchdog UI.
CONFIG_ML_ENABLE_CONFIG_HTTPD=n

# Tailscale subnet-router support from this fork.
CONFIG_ML_ENABLE_SUBNET_ROUTER=y
CONFIG_ML_SUBNET_ROUTE=""

# Headscale control plane.
CONFIG_ML_CTRL_HOST="headscale.novoagatto.com"
CONFIG_ML_CTRL_TLS=y
CONFIG_ML_CTRL_NOISE_PUBKEY_HEX=""

# lwIP / WireGuard.
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_WND_DEFAULT=16384

# mbedTLS / Noise.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y

# CPU / task watchdog.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Flash / OTA partitioning.
# Classic ESP32-WROOM boards used by this example are expected to have 4MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Logging.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
